/* This is a mapping of BRError code failures to localized failure reasons */

/* kBRMediaManagerErrorNoPlayer*/
100 = "無法播放所選的內容。";


/* kBRMediaPlayerNoDatabaseFound*/
200 = "找不到任何內容。";

/* kBRMediaPlayerSongPlaybackError*/
201 = "無法播放目前的歌曲。";


/* kBRMediaNoContent*/
300 = "找不到內容。";

/* kBRMediaNoPhotoContent */
301 = "您的 iPhoto 圖庫中沒有照片。";

/* kBRMediaNoPodcastContent */
302 = "您的 iTunes 資料庫中沒有 podcast。";

/* kBRMediaNotDRMAuthorized */
303 = "您尚未被授權播放此內容。";

/* kBRMediaNoMovieFolderContent */
304 = "您的“影片”檔案夾中沒有影片可以播放。";

/* kBRMediaNoTVShowContent */
305 = "您的 iTunes 資料庫中沒有電視節目。";

/* kBRMediaNoMusicVideoContent */
306 = "您的 iTunes 資料庫中沒有音樂錄影帶。";

/* kBRMediaNoPlaylists */
307 = "您的 iTunes 資料庫中沒有播放列表。";

/* kBRMediaNoSongContent */
308 = "您的 iTunes 資料庫中沒有歌曲。";

/* kBRMediaNoAudioBookContent */
309 = "您的 iTunes 資料庫中沒有有聲書。";

/* kBRMediaEmptyPlaylist */
310 = "此播放列表中沒有歌曲。";

/* kBRMediaNoSuchPlaylist */
311 = "找不到所選的播放列表。";

/* kBRMediaNoSuchSong */
312 = "找不到所選的歌曲。";

/* kBRMediaNoMovies */
315 = "您的“影片”檔案夾中沒有影片。";

/* kBRMediaNoSongForSlideshow */
316 = "無法播放此幻燈片秀的歌曲。";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "無法播放此幻燈片秀的歌曲。";

/* kBRVideoUnplayable */
318 = "無法播放所選的視訊。";

/* kBRMediaRadioStreamUnplayable */
319 = "您選擇的收音機串流無法播放。";

/* kBRRemoteMediaNoContent*/
350 = "找不到此資料庫中的內容。";

/* kBRRemoteMediaNoPhotoContent */
351 = "此資料庫中沒有照片。";

/* kBRRemoteMediaNoPodcastContent */
352 = "此資料庫中沒有 podcast。";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "您尚未被授權播放此內容。";

/* kBRRemoteMediaNoTVShowContent */
355 = "此資料庫中沒有電視節目。";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "此資料庫中沒有音樂錄影帶。";

/* kBRRemoteMediaNoPlaylists */
357 = "此資料庫中沒有播放列表。";

/* kBRRemoteMediaNoSongContent */
358 = "此資料庫中沒有歌曲。";

/* kBRRemoteMediaNoAudioBookContent */
359 = "此資料庫中沒有有聲書。";

/* kBRRemoteMediaEmptyPlaylist */
360 = "此播放列表中沒有歌曲。";

/* kBRRemoteMediaLoadingError */
361 = "載入此內容時發生錯誤。";

/* kBRRemotePhotoSourceUnavailableError */
363 = "無法取得照片共享來源。";

/* kBRDataSourceInitializationFailure*/
400 = "找不到內容。";

/* kBRDataSourceURLResolutionFailure*/
410 = "找不到內容。";

/* kBRDataSourceConnectionInProgressError */
420 = "已在嘗試連接此來源。";


/* KBRSystemNetworkHostUnreachable */
501 = "無法連接此資料庫。";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "目前無法播放電影預告片。";

/* kBRSystemNotHDCPCompliant */
503 = "此內容需要 HDCP 才能播放。";

/* kBRSetupCantSetLanguage */
600 = "無法更改語言。";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "目前無法播放 DVD。";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "無法退出 DVD。";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "DVD 的區域碼與 DVD 播放程式不相符。";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "無法播放 DVD。";

/* kBRDVDErrorFatalDVDAlert */
754 = "無法播放 DVD。";

/* kBRCDErrorCantEjectCDAlert */
755 = "無法退出 CD。";

/*	kDVDErrorAuthentification = -70025,	The user attempting to change the region code could not be authenticated. */
-70025 = "無法驗證此光碟的拷貝防護。";

/* kBRInternalResourceError */
900 = "發生錯誤。";

